InformationRegisters/НастройкиОтправкиЭлектронныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОтправкиЭлектронныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоИнтеркампани</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПрямойОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДоговорСКонтрагентомЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиОтправкиЭлектронныхДокументов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные.ЭтоПрямойОбмен Тогда
		ПараметрыФормы = НастройкиОтправкиЭДОКлиент.НовыеПараметрыФормыНастройкиПрямогоОбмена();
		ПараметрыФормы.Организация = Элемент.ТекущиеДанные.Отправитель;
		ПараметрыФормы.Контрагент = Элемент.ТекущиеДанные.Получатель;
		ПараметрыФормы.Договор = Элемент.ТекущиеДанные.Договор;
		НастройкиОтправкиЭДОКлиент.ОткрытьНастройкуПрямогоОбмена(ПараметрыФормы);
	ИначеЕсли Элемент.ТекущиеДанные.ЭтоИнтеркампани Тогда 
		ПараметрыФормы = НастройкиОтправкиЭДОКлиент.НовыеПараметрыФормыНастроекИнтеркампани();
		ПараметрыФормы.Отправитель = Элемент.ТекущиеДанные.Отправитель;
		ПараметрыФормы.Получатель = Элемент.ТекущиеДанные.Получатель;
		НастройкиОтправкиЭДОКлиент.ОткрытьНастройкуИнтеркампани(ПараметрыФормы);
	Иначе
		ПараметрыФормы = НастройкиОтправкиЭДОКлиент.НовыеПараметрыФормыНастроекОтправки();
		ПараметрыФормы.КлючНастроекОтправки.Отправитель = Элемент.ТекущиеДанные.Отправитель;
		ПараметрыФормы.КлючНастроекОтправки.Получатель = Элемент.ТекущиеДанные.Получатель;
		ПараметрыФормы.КлючНастроекОтправки.Договор = Элемент.ТекущиеДанные.Договор;
		НастройкиОтправкиЭДОКлиент.ОткрытьНастройкуОтправки(ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
